app/Http/Controllers/EncuestaController.php

    protected function survey(){

        return Survey::where('name','Auto Evaluación de Seguridad')->first();
---
select * from `surveys` where `name` = 'Auto Evaluación de Seguridad' limit 1